phoenix-rtos/phoenix-rtos-devices/multi/imxrt-multi/config.h
#ifndef UART5
#define UART5 0
#elif !ISBOOLEAN(UART5)
#error "UART5 must have a value of 0, 1, or be undefined"
#endif

#if UART5

#ifndef UART5_TX_PIN
#warning "[Deprecated] UART5_TX_PIN should be explicitly defined in board_config.h. Using the default"
#define UART5_TX_PIN UART5_TX_PIN_DEFAULT
#elif ISEMPTY(UART5_TX_PIN)
#error "UART5_TX_PIN must not be empty"
#endif

#ifndef UART5_RX_PIN
#warning "[Deprecated] UART5_RX_PIN should be explicitly defined in board_config.h. Using the default"
#define UART5_RX_PIN UART5_RX_PIN_DEFAULT
#elif ISEMPTY(UART5_RX_PIN)
#error "UART5_RX_PIN must not be empty"
#endif

#if UART5_HW_FLOWCTRL

#ifndef UART5_RTS_PIN
#warning "[Deprecated] UART5_RTS_PIN should be explicitly defined in board_config.h. Using the default"
#define UART5_RTS_PIN UART5_RTS_PIN_DEFAULT
#endif

#ifndef UART5_CTS_PIN
#warning "[Deprecated] UART5_CTS_PIN should be explicitly defined in board_config.h. Using the default"
#define UART5_CTS_PIN UART5_CTS_PIN_DEFAULT
#endif

#endif /* #ifdef UART5_HW_FLOWCTRL */

#ifndef UART5_BUFSIZE
#define UART5_BUFSIZE UART_BUFSIZE
#endif

#if ISEMPTY(UART5_BUFSIZE)
#error "UART5_BUFSIZE must not be empty"
#endif

#ifndef UART5_BAUDRATE
#warning "[Deprecated] UART5_BAUDRATE should be explicitly defined in board_config.h. Using the default"
#define UART5_BAUDRATE 115200
#endif

#else
#define UART5_BAUDRATE 0
#define UART5_BUFSIZE  0
#endif /* #if UART5 */


#ifndef UART6
#define UART6 0
#elif !ISBOOLEAN(UART6)
#error "UART6 must have a value of 0, 1, or be undefined"
#endif

#if UART6

#ifndef UART6_TX_PIN
#warning "[Deprecated] UART6_TX_PIN should be explicitly defined in board_config.h. Using the default"
#define UART6_TX_PIN UART6_TX_PIN_DEFAULT
#elif ISEMPTY(UART6_TX_PIN)
#error "UART6_TX_PIN must not be empty"
#endif

#ifndef UART6_RX_PIN
#warning "[Deprecated] UART6_RX_PIN should be explicitly defined in board_config.h. Using the default"
#define UART6_RX_PIN UART6_RX_PIN_DEFAULT
#elif ISEMPTY(UART6_RX_PIN)
#error "UART6_RX_PIN must not be empty"
#endif

#if UART6_HW_FLOWCTRL

#ifndef UART6_RTS_PIN
#warning "[Deprecated] UART6_RTS_PIN should be explicitly defined in board_config.h. Using the default"
#define UART6_RTS_PIN UART6_RTS_PIN_DEFAULT
#endif

#ifndef UART6_CTS_PIN
#warning "[Deprecated] UART6_CTS_PIN should be explicitly defined in board_config.h. Using the default"
#define UART6_CTS_PIN UART6_CTS_PIN_DEFAULT
#endif

#endif /* #ifdef UART6_HW_FLOWCTRL */

#ifndef UART6_BUFSIZE
#define UART6_BUFSIZE UART_BUFSIZE
#endif

#if ISEMPTY(UART6_BUFSIZE)
#error "UART6_BUFSIZE must not be empty"
#endif

#ifndef UART6_BAUDRATE
#warning "[Deprecated] UART6_BAUDRATE should be explicitly defined in board_config.h. Using the default"
#define UART6_BAUDRATE 115200
#endif

#else
#define UART6_BAUDRATE 0
#define UART6_BUFSIZE  0
#endif /* #if UART6 */


#ifndef UART7
#define UART7 0
#elif !ISBOOLEAN(UART7)
#error "UART7 must have a value of 0, 1, or be undefined"
#endif

#if UART7

#ifndef UART7_TX_PIN
#warning "[Deprecated] UART7_TX_PIN should be explicitly defined in board_config.h. Using the default"
#define UART7_TX_PIN UART7_TX_PIN_DEFAULT
#elif ISEMPTY(UART7_TX_PIN)
#error "UART7_TX_PIN must not be empty"
#endif

#ifndef UART7_RX_PIN
#warning "[Deprecated] UART7_RX_PIN should be explicitly defined in board_config.h. Using the default"
#define UART7_RX_PIN UART7_RX_PIN_DEFAULT
#elif ISEMPTY(UART7_RX_PIN)
#error "UART7_RX_PIN must not be empty"
#endif

#if UART7_HW_FLOWCTRL

#ifndef UART7_RTS_PIN
#warning "[Deprecated] UART7_RTS_PIN should be explicitly defined in board_config.h. Using the default"
#define UART7_RTS_PIN UART7_RTS_PIN_DEFAULT
#endif

#ifndef UART7_CTS_PIN
#warning "[Deprecated] UART7_CTS_PIN should be explicitly defined in board_config.h. Using the default"
#define UART7_CTS_PIN UART7_CTS_PIN_DEFAULT
#endif

#endif /* #ifdef UART7_HW_FLOWCTRL */

#ifndef UART7_BUFSIZE
#define UART7_BUFSIZE UART_BUFSIZE
#endif

#if ISEMPTY(UART7_BUFSIZE)
#error "UART7_BUFSIZE must not be empty"
#endif

#ifndef UART7_BAUDRATE
#warning "[Deprecated] UART7_BAUDRATE should be explicitly defined in board_config.h. Using the default"
#define UART7_BAUDRATE 115200
#endif

#else
#define UART7_BAUDRATE 0
#define UART7_BUFSIZE  0
#endif /* #if UART7 */


#ifndef UART8
#define UART8 0
#elif !ISBOOLEAN(UART8)
#error "UART8 must have a value of 0, 1, or be undefined"
#endif

#if UART8

#ifndef UART8_TX_PIN
#warning "[Deprecated] UART8_TX_PIN should be explicitly defined in board_config.h. Using the default"
#define UART8_TX_PIN UART8_TX_PIN_DEFAULT
#elif ISEMPTY(UART8_TX_PIN)
#error "UART8_TX_PIN must not be empty"
#endif

#ifndef UART8_RX_PIN
#warning "[Deprecated] UART8_RX_PIN should be explicitly defined in board_config.h. Using the default"
#define UART8_RX_PIN UART8_RX_PIN_DEFAULT
#elif ISEMPTY(UART8_RX_PIN)
#error "UART8_RX_PIN must not be empty"
#endif

#if UART8_HW_FLOWCTRL

#ifndef UART8_RTS_PIN
#warning "[Deprecated] UART8_RTS_PIN should be explicitly defined in board_config.h. Using the default"
#define UART8_RTS_PIN UART8_RTS_PIN_DEFAULT
#endif

#ifndef UART8_CTS_PIN
#warning "[Deprecated] UART8_CTS_PIN should be explicitly defined in board_config.h. Using the default"
#define UART8_CTS_PIN UART8_CTS_PIN_DEFAULT
#endif

#endif /* #ifdef UART8_HW_FLOWCTRL */

#ifndef UART8_BUFSIZE
#define UART8_BUFSIZE UART_BUFSIZE
#endif

#if ISEMPTY(UART8_BUFSIZE)
#error "UART8_BUFSIZE must not be empty"
#endif

#ifndef UART8_BAUDRATE
#warning "[Deprecated] UART8_BAUDRATE should be explicitly defined in board_config.h. Using the default"
#define UART8_BAUDRATE 115200
#endif

#else
#define UART8_BAUDRATE 0
#define UART8_BUFSIZE  0
#endif /* #if UART8 */


#ifdef __CPU_IMXRT117X


#ifndef UART9
#define UART9 0
#elif !ISBOOLEAN(UART9)
#error "UART9 must have a value of 0, 1, or be undefined"
#endif

#if UART9

#ifndef UART9_TX_PIN
#warning "[Deprecated] UART9_TX_PIN should be explicitly defined in board_config.h. Using the default"
#define UART9_TX_PIN UART9_TX_PIN_DEFAULT
#elif ISEMPTY(UART9_TX_PIN)
#error "UART9_TX_PIN must not be empty"
#endif

#ifndef UART9_RX_PIN
#warning "[Deprecated] UART9_RX_PIN should be explicitly defined in board_config.h. Using the default"
#define UART9_RX_PIN UART9_RX_PIN_DEFAULT
#elif ISEMPTY(UART9_RX_PIN)
#error "UART9_RX_PIN must not be empty"
#endif

