phoenix-rtos/phoenix-rtos-devices/multi/imxrt-multi/config.h
#if UART9_HW_FLOWCTRL

#ifndef UART9_RTS_PIN
#warning "[Deprecated] UART9_RTS_PIN should be explicitly defined in board_config.h. Using the default"
#define UART9_RTS_PIN UART9_RTS_PIN_DEFAULT
#endif

#ifndef UART9_CTS_PIN
#warning "[Deprecated] UART9_CTS_PIN should be explicitly defined in board_config.h. Using the default"
#define UART9_CTS_PIN UART9_CTS_PIN_DEFAULT
#endif

#endif /* #ifdef UART9_HW_FLOWCTRL */

#ifndef UART9_BUFSIZE
#define UART9_BUFSIZE UART_BUFSIZE
#endif

#if ISEMPTY(UART9_BUFSIZE)
#error "UART9_BUFSIZE must not be empty"
#endif

#ifndef UART9_BAUDRATE
#warning "[Deprecated] UART9_BAUDRATE should be explicitly defined in board_config.h. Using the default"
#define UART9_BAUDRATE 115200
#endif

#else
#define UART9_BAUDRATE 0
#define UART9_BUFSIZE  0
#endif /* #if UART9 */


#ifndef UART10
#define UART10 0
#elif !ISBOOLEAN(UART10)
#error "UART10 must have a value of 0, 1, or be undefined"
#endif

#if UART10

#ifndef UART10_TX_PIN
#warning "[Deprecated] UART10_TX_PIN should be explicitly defined in board_config.h. Using the default"
#define UART10_TX_PIN UART10_TX_PIN_DEFAULT
#elif ISEMPTY(UART10_TX_PIN)
#error "UART10_TX_PIN must not be empty"
#endif

#ifndef UART10_RX_PIN
#warning "[Deprecated] UART10_RX_PIN should be explicitly defined in board_config.h. Using the default"
#define UART10_RX_PIN UART10_RX_PIN_DEFAULT
#elif ISEMPTY(UART10_RX_PIN)
#error "UART10_RX_PIN must not be empty"
#endif

#if UART10_HW_FLOWCTRL

#ifndef UART10_RTS_PIN
#warning "[Deprecated] UART10_RTS_PIN should be explicitly defined in board_config.h. Using the default"
#define UART10_RTS_PIN UART10_RTS_PIN_DEFAULT
#endif

#ifndef UART10_CTS_PIN
#warning "[Deprecated] UART10_CTS_PIN should be explicitly defined in board_config.h. Using the default"
#define UART10_CTS_PIN UART10_CTS_PIN_DEFAULT
#endif

#endif /* #ifdef UART10_HW_FLOWCTRL */

#ifndef UART10_BUFSIZE
#define UART10_BUFSIZE UART_BUFSIZE
#endif

#if ISEMPTY(UART10_BUFSIZE)
#error "UART10_BUFSIZE must not be empty"
#endif

#ifndef UART10_BAUDRATE
#warning "[Deprecated] UART10_BAUDRATE should be explicitly defined in board_config.h. Using the default"
#define UART10_BAUDRATE 115200
#endif

#else
#define UART10_BAUDRATE 0
#define UART10_BUFSIZE  0
#endif /* #if UART10 */


#ifndef UART11
#define UART11 0
#elif !ISBOOLEAN(UART11)
#error "UART11 must have a value of 0, 1, or be undefined"
#endif

#if UART11

#ifndef UART11_TX_PIN
#warning "[Deprecated] UART11_TX_PIN should be explicitly defined in board_config.h. Using the default"
#define UART11_TX_PIN UART11_TX_PIN_DEFAULT
#elif ISEMPTY(UART11_TX_PIN)
#error "UART11_TX_PIN must not be empty"
#endif

#ifndef UART11_RX_PIN
#warning "[Deprecated] UART11_RX_PIN should be explicitly defined in board_config.h. Using the default"
#define UART11_RX_PIN UART11_RX_PIN_DEFAULT
#elif ISEMPTY(UART11_RX_PIN)
#error "UART11_RX_PIN must not be empty"
#endif

#if UART11_HW_FLOWCTRL

#ifndef UART11_RTS_PIN
#warning "[Deprecated] UART11_RTS_PIN should be explicitly defined in board_config.h. Using the default"
#define UART11_RTS_PIN UART11_RTS_PIN_DEFAULT
#endif

#ifndef UART11_CTS_PIN
#warning "[Deprecated] UART11_CTS_PIN should be explicitly defined in board_config.h. Using the default"
#define UART11_CTS_PIN UART11_CTS_PIN_DEFAULT
#endif

#endif /* #ifdef UART11_HW_FLOWCTRL */

#ifndef UART11_BUFSIZE
#define UART11_BUFSIZE UART_BUFSIZE
#endif

#if ISEMPTY(UART11_BUFSIZE)
#error "UART11_BUFSIZE must not be empty"
#endif

#ifndef UART11_BAUDRATE
#warning "[Deprecated] UART11_BAUDRATE should be explicitly defined in board_config.h. Using the default"
#define UART11_BAUDRATE 115200
#endif

#else
#define UART11_BAUDRATE 0
#define UART11_BUFSIZE  0
#endif /* #if UART11 */


#ifndef UART12
#define UART12 0
#elif !ISBOOLEAN(UART12)
#error "UART12 must have a value of 0, 1, or be undefined"
#endif

#if UART12

#ifndef UART12_TX_PIN
#warning "[Deprecated] UART12_TX_PIN should be explicitly defined in board_config.h. Using the default"
#define UART12_TX_PIN UART12_TX_PIN_DEFAULT
#elif ISEMPTY(UART12_TX_PIN)
#error "UART12_TX_PIN must not be empty"
#endif

#ifndef UART12_RX_PIN
#warning "[Deprecated] UART12_RX_PIN should be explicitly defined in board_config.h. Using the default"
#define UART12_RX_PIN UART12_RX_PIN_DEFAULT
#elif ISEMPTY(UART12_RX_PIN)
#error "UART12_RX_PIN must not be empty"
#endif

#if UART12_HW_FLOWCTRL

#ifndef UART12_RTS_PIN
#warning "[Deprecated] UART12_RTS_PIN should be explicitly defined in board_config.h. Using the default"
#define UART12_RTS_PIN UART12_RTS_PIN_DEFAULT
#endif

#ifndef UART12_CTS_PIN
#warning "[Deprecated] UART12_CTS_PIN should be explicitly defined in board_config.h. Using the default"
#define UART12_CTS_PIN UART12_CTS_PIN_DEFAULT
#endif

#endif /* #ifdef UART12_HW_FLOWCTRL */

#ifndef UART12_BUFSIZE
#define UART12_BUFSIZE UART_BUFSIZE
#endif

#if ISEMPTY(UART12_BUFSIZE)
#error "UART12_BUFSIZE must not be empty"
#endif

#ifndef UART12_BAUDRATE
#warning "[Deprecated] UART12_BAUDRATE should be explicitly defined in board_config.h. Using the default"
#define UART12_BAUDRATE 115200
#endif

#else
#define UART12_BAUDRATE 0
#define UART12_BUFSIZE  0
#endif /* #if UART12 */


#else

#define UART9           0
#define UART9_BUFSIZE   0
#define UART9_BAUDRATE  0
#define UART10          0
#define UART10_BUFSIZE  0
#define UART10_BAUDRATE 0
#define UART11          0
#define UART11_BUFSIZE  0
#define UART11_BAUDRATE 0
#define UART12          0
#define UART12_BUFSIZE  0
#define UART12_BAUDRATE 0

#endif /* #ifdef __CPU_IMXRT117X */

/* clang-format off */

#define UART_BAUDRATES \
	UART1_BAUDRATE, \
	UART2_BAUDRATE, \
	UART3_BAUDRATE, \
	UART4_BAUDRATE, \
	UART5_BAUDRATE, \
	UART6_BAUDRATE, \
	UART7_BAUDRATE, \
	UART8_BAUDRATE, \
	UART9_BAUDRATE, \
	UART10_BAUDRATE, \
	UART11_BAUDRATE, \
	UART12_BAUDRATE

#define UART_BUFSIZES \
	UART1_BUFSIZE, \
	UART2_BUFSIZE, \
	UART3_BUFSIZE, \
	UART4_BUFSIZE, \
	UART5_BUFSIZE, \
	UART6_BUFSIZE, \
	UART7_BUFSIZE, \
	UART8_BUFSIZE, \
	UART9_BUFSIZE, \
	UART10_BUFSIZE, \
	UART11_BUFSIZE, \
	UART12_BUFSIZE

/* clang-format on */

#if !defined(UART_CONSOLE) && !defined(RTT_CHANNEL_CONSOLE)
#if defined(__CPU_IMXRT105X)
#define UART_CONSOLE 1
#elif defined(__CPU_IMXRT106X)
#define UART_CONSOLE 1
#elif defined(__CPU_IMXRT117X)
#define UART_CONSOLE 11
#else
#define UART_CONSOLE 1
#endif
#endif

#if defined(UART_CONSOLE)
#if ISEMPTY(UART_CONSOLE)
#error "UART_CONSOLE must not be empty"
#elif UART_CONSOLE <= 0
#error "Invalid value for UART_CONSOLE"
#endif
#endif


/* RTT */

#ifndef RTT_CHANNEL0
#define RTT_CHANNEL0 0
#elif !ISBOOLEAN(RTT_CHANNEL0)
#error "RTT_CHANNEL0 must have a value of 0, 1, or be undefined"
#endif

#ifndef RTT_CHANNEL1
#define RTT_CHANNEL1 0
#elif !ISBOOLEAN(RTT_CHANNEL1)
#error "RTT_CHANNEL1 must have a value of 0, 1, or be undefined"
#endif

#ifndef RTT_CHANNEL0_BLOCKING
#define RTT_CHANNEL0_BLOCKING 0
#elif !ISBOOLEAN(RTT_CHANNEL0_BLOCKING)
#error "RTT_CHANNEL0_BLOCKING must have a value of 0, 1, or be undefined"
#endif

