phoenix-rtos/phoenix-rtos-devices/multi/imxrt-multi/config.h
#ifndef RTT_CHANNEL1_BLOCKING
#define RTT_CHANNEL1_BLOCKING 0
#elif !ISBOOLEAN(RTT_CHANNEL1_BLOCKING)
#error "RTT_CHANNEL1_BLOCKING must have a value of 0, 1, or be undefined"
#endif


#if defined(UART_CONSOLE) && defined(RTT_CHANNEL_CONSOLE)
#error "Console on UART and RTT not supported"
#elif defined(RTT_CHANNEL_CONSOLE)
#if ISEMPTY(RTT_CHANNEL_CONSOLE)
#error "RTT_CHANNEL_CONSOLE must not be empty"
#elif RTT_CHANNEL_CONSOLE < 0
#error "Invalid value for RTT_CHANNEL_CONSOLE"
#endif

#define ONLY_RTT_CONSOLE
#endif


/* SPI */

#ifndef SPI1
#define SPI1 0
#elif !ISBOOLEAN(SPI1)
#error "SPI1 must have a value of 0, 1, or be undefined"
#endif

#if SPI1

#ifndef SPI1_SCK
#warning "[Deprecated] SPI1_SCK should be explicitly defined in board_config.h. Using the default"
#define SPI1_SCK SPI1_SCK_DEFAULT
#elif ISEMPTY(SPI1_SCK)
#error "SPI1_SCK must not be empty"
#endif

#ifdef SPI1_SD0
#warning "[Deprecated] SPI1_SDO (ending with letter O) should be used instead of SPI1_SD0 (ending with zero)"
#define SPI1_SDO SPI1_SD0
#endif

#ifndef SPI1_SDO
#warning "[Deprecated] SPI1_SDO should be explicitly defined in board_config.h. Using the default"
#define SPI1_SDO SPI1_SDO_DEFAULT
#elif ISEMPTY(SPI1_SDO)
#error "SPI1_SDO must not be empty"
#endif

#ifndef SPI1_SDI
#warning "[Deprecated] SPI1_SDI should be explicitly defined in board_config.h. Using the default"
#define SPI1_SDI SPI1_SDI_DEFAULT
#elif ISEMPTY(SPI1_SDI)
#error "SPI1_SDI must not be empty"
#endif

#ifndef SPI1_PCS0
#warning "[Deprecated] SPI1_PCS0 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI1_PCS0 SPI1_PCS0_DEFAULT
#endif

#ifndef SPI1_PCS1
#warning "[Deprecated] SPI1_PCS1 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI1_PCS1 SPI1_PCS1_DEFAULT
#endif

#ifndef SPI1_PCS2
#warning "[Deprecated] SPI1_PCS2 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI1_PCS2 SPI1_PCS2_DEFAULT
#endif

#ifndef SPI1_PCS3
#warning "[Deprecated] SPI1_PCS3 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI1_PCS3 SPI1_PCS3_DEFAULT
#endif

#endif /* #if SPI1 */


#ifndef SPI2
#define SPI2 0
#elif !ISBOOLEAN(SPI2)
#error "SPI2 must have a value of 0, 1, or be undefined"
#endif

#if SPI2

#ifndef SPI2_SCK
#warning "[Deprecated] SPI2_SCK should be explicitly defined in board_config.h. Using the default"
#define SPI2_SCK SPI2_SCK_DEFAULT
#elif ISEMPTY(SPI2_SCK)
#error "SPI2_SCK must not be empty"
#endif

#ifdef SPI2_SD0
#warning "[Deprecated] SPI2_SDO (ending with letter O) should be used instead of SPI2_SD0 (ending with zero)"
#define SPI2_SDO SPI2_SD0
#endif

#ifndef SPI2_SDO
#warning "[Deprecated] SPI2_SDO should be explicitly defined in board_config.h. Using the default"
#define SPI2_SDO SPI2_SDO_DEFAULT
#elif ISEMPTY(SPI2_SDO)
#error "SPI2_SDO must not be empty"
#endif

#ifndef SPI2_SDI
#warning "[Deprecated] SPI2_SDI should be explicitly defined in board_config.h. Using the default"
#define SPI2_SDI SPI2_SDI_DEFAULT
#elif ISEMPTY(SPI2_SDI)
#error "SPI2_SDI must not be empty"
#endif

#ifndef SPI2_PCS0
#warning "[Deprecated] SPI2_PCS0 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI2_PCS0 SPI2_PCS0_DEFAULT
#endif

#ifndef SPI2_PCS1
#warning "[Deprecated] SPI2_PCS1 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI2_PCS1 SPI2_PCS1_DEFAULT
#endif

#ifndef SPI2_PCS2
#warning "[Deprecated] SPI2_PCS2 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI2_PCS2 SPI2_PCS2_DEFAULT
#endif

#ifndef SPI2_PCS3
#warning "[Deprecated] SPI2_PCS3 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI2_PCS3 SPI2_PCS3_DEFAULT
#endif

#endif /* #if SPI2 */


#ifndef SPI3
#define SPI3 0
#elif !ISBOOLEAN(SPI3)
#error "SPI3 must have a value of 0, 1, or be undefined"
#endif

#if SPI3

#ifndef SPI3_SCK
#warning "[Deprecated] SPI3_SCK should be explicitly defined in board_config.h. Using the default"
#define SPI3_SCK SPI3_SCK_DEFAULT
#elif ISEMPTY(SPI3_SCK)
#error "SPI3_SCK must not be empty"
#endif

#ifdef SPI3_SD0
#warning "[Deprecated] SPI3_SDO (ending with letter O) should be used instead of SPI3_SD0 (ending with zero)"
#define SPI3_SDO SPI3_SD0
#endif

#ifndef SPI3_SDO
#warning "[Deprecated] SPI3_SDO should be explicitly defined in board_config.h. Using the default"
#define SPI3_SDO SPI3_SDO_DEFAULT
#elif ISEMPTY(SPI3_SDO)
#error "SPI3_SDO must not be empty"
#endif

#ifndef SPI3_SDI
#warning "[Deprecated] SPI3_SDI should be explicitly defined in board_config.h. Using the default"
#define SPI3_SDI SPI3_SDI_DEFAULT
#elif ISEMPTY(SPI3_SDI)
#error "SPI3_SDI must not be empty"
#endif

#ifndef SPI3_PCS0
#warning "[Deprecated] SPI3_PCS0 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI3_PCS0 SPI3_PCS0_DEFAULT
#endif

#ifndef SPI3_PCS1
#warning "[Deprecated] SPI3_PCS1 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI3_PCS1 SPI3_PCS1_DEFAULT
#endif

#ifndef SPI3_PCS2
#warning "[Deprecated] SPI3_PCS2 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI3_PCS2 SPI3_PCS2_DEFAULT
#endif

#ifndef SPI3_PCS3
#warning "[Deprecated] SPI3_PCS3 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI3_PCS3 SPI3_PCS3_DEFAULT
#endif

#endif /* #if SPI3 */


#ifndef SPI4
#define SPI4 0
#elif !ISBOOLEAN(SPI4)
#error "SPI4 must have a value of 0, 1, or be undefined"
#endif

#if SPI4

#ifndef SPI4_SCK
#warning "[Deprecated] SPI4_SCK should be explicitly defined in board_config.h. Using the default"
#define SPI4_SCK SPI4_SCK_DEFAULT
#elif ISEMPTY(SPI4_SCK)
#error "SPI4_SCK must not be empty"
#endif

#ifdef SPI4_SD0
#warning "[Deprecated] SPI4_SDO (ending with letter O) should be used instead of SPI4_SD0 (ending with zero)"
#define SPI4_SDO SPI4_SD0
#endif

#ifndef SPI4_SDO
#warning "[Deprecated] SPI4_SDO should be explicitly defined in board_config.h. Using the default"
#define SPI4_SDO SPI4_SDO_DEFAULT
#elif ISEMPTY(SPI4_SDO)
#error "SPI4_SDO must not be empty"
#endif

#ifndef SPI4_SDI
#warning "[Deprecated] SPI4_SDI should be explicitly defined in board_config.h. Using the default"
#define SPI4_SDI SPI4_SDI_DEFAULT
#elif ISEMPTY(SPI4_SDI)
#error "SPI4_SDI must not be empty"
#endif

#ifndef SPI4_PCS0
#warning "[Deprecated] SPI4_PCS0 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI4_PCS0 SPI4_PCS0_DEFAULT
#endif

#ifndef SPI4_PCS1
#warning "[Deprecated] SPI4_PCS1 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI4_PCS1 SPI4_PCS1_DEFAULT
#endif

#ifndef SPI4_PCS2
#warning "[Deprecated] SPI4_PCS2 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI4_PCS2 SPI4_PCS2_DEFAULT
#endif

#ifndef SPI4_PCS3
#warning "[Deprecated] SPI4_PCS3 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI4_PCS3 SPI4_PCS3_DEFAULT
#endif

#endif /* #if SPI4 */


