phoenix-rtos/phoenix-rtos-devices/multi/imxrt-multi/config.h
#ifdef __CPU_IMXRT117X


#ifndef SPI5
#define SPI5 0
#elif !ISBOOLEAN(SPI5)
#error "SPI5 must have a value of 0, 1, or be undefined"
#endif

#if SPI5

#ifndef SPI5_SCK
#warning "[Deprecated] SPI5_SCK should be explicitly defined in board_config.h. Using the default"
#define SPI5_SCK SPI5_SCK_DEFAULT
#elif ISEMPTY(SPI5_SCK)
#error "SPI5_SCK must not be empty"
#endif

#ifdef SPI5_SD0
#warning "[Deprecated] SPI5_SDO (ending with letter O) should be used instead of SPI5_SD0 (ending with zero)"
#define SPI5_SDO SPI5_SD0
#endif

#ifndef SPI5_SDO
#warning "[Deprecated] SPI5_SDO should be explicitly defined in board_config.h. Using the default"
#define SPI5_SDO SPI5_SDO_DEFAULT
#elif ISEMPTY(SPI5_SDO)
#error "SPI5_SDO must not be empty"
#endif

#ifndef SPI5_SDI
#warning "[Deprecated] SPI5_SDI should be explicitly defined in board_config.h. Using the default"
#define SPI5_SDI SPI5_SDI_DEFAULT
#elif ISEMPTY(SPI5_SDI)
#error "SPI5_SDI must not be empty"
#endif

#ifndef SPI5_PCS0
#warning "[Deprecated] SPI5_PCS0 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI5_PCS0 SPI5_PCS0_DEFAULT
#endif

#ifndef SPI5_PCS1
#warning "[Deprecated] SPI5_PCS1 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI5_PCS1 SPI5_PCS1_DEFAULT
#endif

#ifndef SPI5_PCS2
#warning "[Deprecated] SPI5_PCS2 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI5_PCS2 SPI5_PCS2_DEFAULT
#endif

#ifndef SPI5_PCS3
#warning "[Deprecated] SPI5_PCS3 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI5_PCS3 SPI5_PCS3_DEFAULT
#endif

#endif /* #if SPI5 */


#ifndef SPI6
#define SPI6 0
#elif !ISBOOLEAN(SPI6)
#error "SPI6 must have a value of 0, 1, or be undefined"
#endif

#if SPI6

#ifndef SPI6_SCK
#warning "[Deprecated] SPI6_SCK should be explicitly defined in board_config.h. Using the default"
#define SPI6_SCK SPI6_SCK_DEFAULT
#elif ISEMPTY(SPI6_SCK)
#error "SPI6_SCK must not be empty"
#endif

#ifdef SPI6_SD0
#warning "[Deprecated] SPI6_SDO (ending with letter O) should be used instead of SPI6_SD0 (ending with zero)"
#define SPI6_SDO SPI6_SD0
#endif

#ifndef SPI6_SDO
#warning "[Deprecated] SPI6_SDO should be explicitly defined in board_config.h. Using the default"
#define SPI6_SDO SPI6_SDO_DEFAULT
#elif ISEMPTY(SPI6_SDO)
#error "SPI6_SDO must not be empty"
#endif

#ifndef SPI6_SDI
#warning "[Deprecated] SPI6_SDI should be explicitly defined in board_config.h. Using the default"
#define SPI6_SDI SPI6_SDI_DEFAULT
#elif ISEMPTY(SPI6_SDI)
#error "SPI6_SDI must not be empty"
#endif

#ifndef SPI6_PCS0
#warning "[Deprecated] SPI6_PCS0 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI6_PCS0 SPI6_PCS0_DEFAULT
#endif

#ifndef SPI6_PCS1
#warning "[Deprecated] SPI6_PCS1 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI6_PCS1 SPI6_PCS1_DEFAULT
#endif

#ifndef SPI6_PCS2
#warning "[Deprecated] SPI6_PCS2 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI6_PCS2 SPI6_PCS2_DEFAULT
#endif

#ifndef SPI6_PCS3
#warning "[Deprecated] SPI6_PCS3 should be explicitly defined (may be empty) in board_config.h. Using the default"
#define SPI6_PCS3 SPI6_PCS3_DEFAULT
#endif

#endif /* #if SPI6 */


#else

#define SPI5 0
#define SPI6 0

#endif /* #ifdef __CPU_IMXRT117X */


/* I2C */

#ifndef I2C1
#define I2C1 0
#elif !ISBOOLEAN(I2C1)
#error "I2C1 must have a value of 0, 1, or be undefined"
#endif

#ifndef I2C2
#define I2C2 0
#elif !ISBOOLEAN(I2C2)
#error "I2C2 must have a value of 0, 1, or be undefined"
#endif

#ifndef I2C3
#define I2C3 0
#elif !ISBOOLEAN(I2C3)
#error "I2C3 must have a value of 0, 1, or be undefined"
#endif

#ifndef I2C4
#define I2C4 0
#elif !ISBOOLEAN(I2C4)
#error "I2C4 must have a value of 0, 1, or be undefined"
#endif

#ifdef __CPU_IMXRT117X

#ifndef I2C5
#define I2C5 0
#elif !ISBOOLEAN(I2C5)
#error "I2C5 must have a value of 0, 1, or be undefined"
#endif

#ifndef I2C6
#define I2C6 0
#elif !ISBOOLEAN(I2C6)
#error "I2C6 must have a value of 0, 1, or be undefined"
#endif

#endif /* #ifdef __CPU_IMXRT117X */

#ifndef I2C1_PUSHPULL
#define I2C1_PUSHPULL 0
#endif

#ifndef I2C2_PUSHPULL
#define I2C2_PUSHPULL 0
#endif

#ifndef I2C3_PUSHPULL
#define I2C3_PUSHPULL 0
#endif

#ifndef I2C4_PUSHPULL
#define I2C4_PUSHPULL 0
#endif

#ifndef I2C5_PUSHPULL
#define I2C5_PUSHPULL 0
#endif

#ifndef I2C6_PUSHPULL
#define I2C6_PUSHPULL 0
#endif

#ifndef I2C1_SPEED
#define I2C1_SPEED i2c_speed_slow
#endif

#ifndef I2C2_SPEED
#define I2C2_SPEED i2c_speed_slow
#endif

#ifndef I2C3_SPEED
#define I2C3_SPEED i2c_speed_slow
#endif

#ifndef I2C4_SPEED
#define I2C4_SPEED i2c_speed_slow
#endif

#ifndef I2C5_SPEED
#define I2C5_SPEED i2c_speed_slow
#endif

#ifndef I2C6_SPEED
#define I2C6_SPEED i2c_speed_slow
#endif


/* TRNG */

#ifndef __CPU_IMXRT117X

#ifndef TRNG
#define TRNG 0
#endif

#endif /* #ifndef __CPU_IMXRT117X */

/* Temperature */

#ifndef PCT2075
#define PCT2075 0
#elif !ISBOOLEAN(PCT2075)
#error "PCT2075 must have a value of 0, 1, or be undefined"
#elif !defined(PCT2075_BUS_NUM)
#error "PCT2075_BUS_NUM must be defined"
#elif !defined(PCT2075_DEV_ADDR)
#error "PCT2075_DEV_ADDR must be defined"
#endif

/* libdummyfs */
#ifndef BUILTIN_DUMMYFS
#define BUILTIN_DUMMYFS 0
#endif

/* Cortex M4 */

#ifdef __CPU_IMXRT117X

#ifndef CM4
#define CM4 1
#endif

#endif

#endif
